Revit 2026 API

# DWGExportOptions(DWGExportOptions) Constructor

---

Constructs a new instance of DWGExportOptions as a copy of the export options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DWGExportOptions(
	DWGExportOptions option
)
```
```vb
Public Sub New (
	option As DWGExportOptions
)
```
```cpp
public:
DWGExportOptions(
	DWGExportOptions^ option
)
```
```fsharp
new :
        option : DWGExportOptions -> DWGExportOptions
```

#### Parameters

option DWGExportOptions
     The options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DWGExportOptions Class

DWGExportOptions Overload

Autodesk.Revit.DB Namespace